In [1]:
import pandas as pd
import numpy as np
#for excute the program ham use karte h [shift+enter] taki naye jupyter mei kar sake rest part of the question.

In [29]:
#example and syntax for writting raw data into tabular form by using pandas library and numpy library.
dict1={
    "name":["khush","raunak","rishabh","omkar","abhijeet"],
    "age":[19,20,21,19,18],
    "height":["5.8ft","5.9ft","5.10ft","5.8ft","5.10ft"]
}

In [50]:
#SYNTAX for raw data to tabular form =>variable_name=pd(pandas).DataFrame(raw_data_name)
df = pd.DataFrame(dict1)

In [31]:
df

       name  age  height
0     khush   19   5.8ft
1    raunak   20   5.9ft
2   rishabh   21  5.10ft
3     omkar   19   5.8ft
4  abhijeet   18  5.10ft

In [43]:
#converting data to csv (excel form)
#SYNTAX =>variable_name.to_csv('csv_file_name.csv')
df.to_csv('parth.csv')

In [47]:
#ek baat yaad rakho jab bhi condition likho True/False usska phala letter jase T or F capital hu,nahi hoga tuh error ayega.
df.to_csv('parth_index_false.csv',index=False)

In [52]:
#agar jase dataframe million mei h ... aur aapko starting kuch selective dekhna h 
#Syntax and example 
df.head(2)

     name  age height
0   khush   19  5.8ft
1  raunak   20  5.9ft

In [53]:
#agar jase dataframe million mei h ... aur aapko ending kuch selective dekhna h 
#Syntax and example
df.tail(2)

       name  age  height
3     omkar   19   5.8ft
4  abhijeet   18  5.10ft

In [54]:
#.describe() its means that it will the mean,count,std,min,25%,75 etc, of the numerical value in the dataframe. 
#Syntax and example
df.describe()

             age
count   5.000000
mean   19.400000
std     1.140175
min    18.000000
25%    19.000000
50%    19.000000
75%    20.000000
max    21.000000

In [78]:
#suppose jase agar tum koi csv excel file h tume usse import karke check karna h python mei\
#syntax and example    
 reman = pd.read_csv('reman.csv')

IndentationError: unexpected indent (3745126973.py, line 3)

In [79]:
reman

       name  age  height
0     khush   19   5.8ft
1    raunak   20   5.9ft
2   rishabh   21  5.10ft
3     omkar   19   5.8ft
4  abhijeet   18  5.10ft

In [84]:
#agar tume import kari  csv file ke data mei kuch change karna h 
#syntax and example
#csv_file_name[column_name][index_number]= enter_the_changed_value.
reman["age"][1]=18

C:\Users\ASUS\AppData\Local\Temp\ipykernel_29780\2314822041.py:4: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  ran=reman["age"][1]=18
C:\Users\ASUS\AppData\Local\Temp\ipykernel_29780\2314822041.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ran=reman["age"][1]=18

In [87]:
#change ko kisi bhi variable  save mat karna kyuki kyuki agar save kiya tuh wo changed value return karega output mei.
reman

       name  age  height
0     khush   19   5.8ft
1    raunak   18   5.9ft
2   rishabh   21  5.10ft
3     omkar   19   5.8ft
4  abhijeet   18  5.10ft